app/forms/sjabloon/signup_form.rb

    def create_user
      @user = User.create!(
        name:                  name,
        email:                 email,
        password:              password,
      )
---
INSERT INTO "users" ("email", "encrypted_password", "first_name", "created_at", "updated_at", "adminrole") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

    def email_is_unique
      if User.exists? email: email
---
SELECT 1 AS one FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", ""], ["LIMIT", 1]]